gdgly/stm32_a7108_rev4v2_gat920/Hardware/gat920/gatconfig.c
/**
  *********************************************************************************************************
  * @file    gatconfig.c
  * @author  MoveBroad -- KangYJ
  * @version V1.0
  * @date    
  * @brief   
  *********************************************************************************************************
  * @attention
  *			功能 : 
  *			1.  擦除GAT参数存储Flash区
  *			2.  读取GAT参数存储Flash区地址
  *			3.  写入GAT参数存储Flash区数据
  *			4.  保存GAT检测器参数到Flash
  *			5.  读取GAT检测器参数到Ram
  *			6.  初始化GAT检测器参数
  *			7.  读取output_ID输出端口的参数到GAT脉冲上传通道号对应地磁编号
  *			8.  GAT初始化事件
  *			9.  GAT准备中事件
  *			10. GAT接收数据前期处理事件
  *			11. GAT接收数据分析处理事件
  *			12. GAT发送数据后期处理事件
  *			13. GAT主动上传事件
  *			14. 处理GAT协议各个事件
  *********************************************************************************************************
  */

#include "gatconfig.h"
#include "gatfunc.h"
#include "gatconnect.h"
#include "gatserial.h"
#include "gatupload.h"
#include "string.h"
#include "stm32_config.h"


#define GAT_RO_FLashAddr  	((u32)0x080BE800)								//SN存储地址
#define GAT_RW_StartAddr		((u32)0x080BF800)
#define GAT_RW_FLashAddr_p1	((u32)0x080BF800)								//GAT检测器参数保存区
#define GAT_RW_FLashAddr_p2	((u32)0x080BF900)								//GAT脉冲数据上传配置参数保存区
#define GAT_RW_FLashAddr_p3	((u32)0x080BFA00)								//GAT设备配置参数保存区
#define GAT_RW_FLashAddr_p4	((u32)0x080BFB00)
#define GAT_RW_FLashAddr_p5	((u32)0x080BFC00)
#define GAT_RW_FLashAddr_p6	((u32)0x080BFD00)
#define GAT_RW_FLashAddr_p7	((u32)0x080BFE00)
#define GAT_RW_FLashAddr_p8	((u32)0x080BFF00)
#define GAT_EndAddr			((u32)0x080C0000)
#define GAT_PageSize		((u16)0x800)									//RCT6 PageSize = 2048Byte

#define GATPARAMDETECTORLENGTH	(sizeof(gatParamDetector) % 4) != 0 ? (sizeof(gatParamDetector) / 4 + 1) : (sizeof(gatParamDetector) / 4)
#define GATPARAMPULSELENGTH		(sizeof(gatParamPulse) % 4) != 0 ? (sizeof(gatParamPulse) / 4 + 1) : (sizeof(gatParamPulse) / 4)
#define GATPARAMEQUIPMENTLENGTH	(sizeof(gatParamEquipment) % 4) != 0 ? (sizeof(gatParamEquipment) / 4 + 1) : (sizeof(gatParamEquipment) / 4)

Gat_Param_Detector			gatParamDetector;								//GAT检测器参数
Gat_PulseUploadConfig_Data	gatParamPulse;									//GAT脉冲数据上传配置参数
Gat_Param_Equipment_Config	gatParamEquipment;								//GAT设备配置参数

GATEventType				GATEvent = GAT_EVENT_INITIALIZED;					//GAT状态机状态值
GATConnectType				GATConnect = GAT_OFFLINE;						//GAT连接状态
GATUPLOADAckType			GATUPLOADAck = GAT_ReceivedAck;					//GAT上传数据接收应答状态
GATActiveUpLoadModeType		GATActiveUpLoadMode = GAT_ActiveUpLoadMode_NONE;		//GAT主动上传模式

u8 GAT_USART_RXIT = 0;
u8 GAT_USART_TXIT = 0;

/**********************************************************************************************************
 @Function			void GAT_FlashErase(u32 StartAddr)
 @Description			擦除GAT参数存储Flash区
 @Input				StartAddr : 起始地址
 @Return				void
**********************************************************************************************************/
void GAT_FlashErase(u32 StartAddr)
{
	volatile FLASH_Status FLASHStatus;
	volatile u32 NbrOfPage = 0;
	u32 EraseCounter = 0x0;
	
	FLASHStatus = FLASH_COMPLETE;
	NbrOfPage = (GAT_EndAddr - StartAddr) >> 11;
	FLASH_ClearFlag(FLASH_FLAG_BSY | FLASH_FLAG_EOP | FLASH_FLAG_PGERR | FLASH_FLAG_WRPRTERR);
	for (EraseCounter = 0; (EraseCounter < NbrOfPage) && (FLASHStatus == FLASH_COMPLETE); EraseCounter++) {
		FLASHStatus = FLASH_ErasePage(StartAddr + (GAT_PageSize * EraseCounter));
	}
}

/**********************************************************************************************************
 @Function			u32 GAT_FlashRead(u32 addr)
 @Description			读取GAT参数存储Flash区地址
 @Input				addr : 读取地址
 @Return				该地址值
**********************************************************************************************************/
u32 GAT_FlashRead(u32 addr)
{
	FLASH_ClearFlag(FLASH_FLAG_BSY | FLASH_FLAG_EOP | FLASH_FLAG_PGERR | FLASH_FLAG_WRPRTERR);
	
	return (*(volatile u32*) addr);
}

/**********************************************************************************************************
 @Function			u32 GAT_FlashWrite(u32 addr, u32 *data, u16 num)
 @Description			写入GAT参数存储Flash区数据
 @Input				addr  : 写入地址
					*data : 数据
					num   : 长度/4
 @Return				FLASHStatus
**********************************************************************************************************/
u32 GAT_FlashWrite(u32 addr, u32 *data, u16 num)
{
	u16 i = 0;
	volatile FLASH_Status FLASHStatus;
	
	while ((FLASHStatus == FLASH_COMPLETE) && (i < num)) {
		FLASHStatus = FLASH_ProgramWord((addr + i * 4), data[i]);
		i++;
	}
	
	return FLASHStatus;
}

/**********************************************************************************************************
 @Function			void GAT_ParamSaveToFlash(void)
 @Description			保存GAT检测器参数到Flash
 @Input				void
 @Return				void
**********************************************************************************************************/
void GAT_ParamSaveToFlash(void)
{
	FLASH_Unlock();
	GAT_FlashErase(GAT_RW_StartAddr);												//擦除对应存储FlashPage
	GAT_FlashWrite(GAT_RW_FLashAddr_p1, (u32*) &gatParamDetector, GATPARAMDETECTORLENGTH);	//写入GAT检测器参数
	GAT_FlashWrite(GAT_RW_FLashAddr_p2, (u32*) &gatParamPulse, GATPARAMPULSELENGTH);		//写入GAT脉冲数据上传配置参数
	GAT_FlashWrite(GAT_RW_FLashAddr_p3, (u32*) &gatParamEquipment, GATPARAMEQUIPMENTLENGTH);	//写入GAT设备配置参数
	FLASH_Lock();
}

/**********************************************************************************************************
 @Function			void GAT_ParamReadToFlash(void)
 @Description			读取GAT检测器参数到Ram
 @Input				void
 @Return				void
**********************************************************************************************************/
void GAT_ParamReadToFlash(void)
{
	u32 *params;
	u16 i = 0, length = 0;
	
	length = GATPARAMDETECTORLENGTH;												//读取GAT检测器参数
	params = (u32 *)&gatParamDetector;
	for (i = 0; i < length; i++) {
		delay_5us(240);
		params[i] = GAT_FlashRead(GAT_RW_FLashAddr_p1 + i * 4);
	}
	
	length = GATPARAMPULSELENGTH;													//读取GAT脉冲数据上传配置参数
	params = (u32 *)&gatParamPulse;
	for (i = 0; i < length; i++) {
		delay_5us(240);
		params[i] = GAT_FlashRead(GAT_RW_FLashAddr_p2 + i * 4);
	}
	
	length = GATPARAMEQUIPMENTLENGTH;												//读取GAT设备配置参数
	params = (u32 *)&gatParamEquipment;
	for (i = 0; i < length; i++) {
		delay_5us(240);
		params[i] = GAT_FlashRead(GAT_RW_FLashAddr_p3 + i * 4);
	}
}

/**********************************************************************************************************
 @Function			void GAT_InitParamDetectorDefault(u32 sn)
 @Description			初始化GAT检测器参数
 @Input				sn
 @Return				void
**********************************************************************************************************/
void GAT_InitParamDetectorDefault(u32 sn)
{
	gatParamDetector.manufacturers_length 				= sizeof(EquipmentManufacturers);	//检测器制造商名称字节数
	strcpy((char *)gatParamDetector.manufacturers_name, EquipmentManufacturers);			//检测器制造商名称
	gatParamDetector.model_length						= sizeof(EquipmentModel);		//检测器型号的字节数
	strcpy((char *)gatParamDetector.model_name, EquipmentModel);						//检测器的型号
	gatParamDetector.detection_channels				= DetectionChannels;			//最大检测通道数
	gatParamDetector.statistical_mode					= STATISTICALMODE_NONEMODE;		//统计方式
	gatParamDetector.avgshare						= AVGSHARE_ENABLE;				//车辆平均占有率
	gatParamDetector.avgspeed						= AVGSPEED_DISABLE;				//车辆平均行驶速度
	gatParamDetector.avglength						= AVGLENGTH_DISABLE;			//车辆平均车长
	gatParamDetector.avgheadtime						= AVGHEADTIME_ENABLE;			//车辆平均车头时距
	gatParamDetector.queuing_length					= QUEUINGLENGTH_DISABLE;			//车辆排队长度
	gatParamDetector.reserved						= 0;							//保留字段
	gatParamDetector.detection_mode					= DetectionMode;				//检测手段
	gatParamDetector.signal_output_delay				= SignalOutputDelay;			//信号输出延时
	gatParamDetector.detector_config.statistical_period	= 60;						//统计数据的计算周期
	gatParamDetector.detector_config.Acar_langth			= 200;						//A类车车长
	gatParamDetector.detector_config.Bcar_length			= 100;						//B类车车长
	gatParamDetector.detector_config.Ccar_length			= 50;						//C类车车长
	
	gatParamPulse.pulseUploadChannel					= 1;							//脉冲上传检测通道数
	memset(gatParamPulse.pulseUploadBit, 0x0, sizeof(gatParamPulse.pulseUploadBit));		//脉冲数据上传通道使能位
	
	gatParamEquipment.SN							= sn;						//SN
	gatParamEquipment.baudRate						= GAT920_BAUDRATE;				//默认通信波特率
	memset((u8 *)gatParamEquipment.output_ID, 0x0, sizeof(gatParamEquipment.output_ID));		//清脉冲上传通道号对应地磁编号
}

/**********************************************************************************************************
 @Function			void GAT_GetOutputID(u16 *outputid)
 @Description			读取output_ID输出端口的参数到GAT脉冲上传通道号对应地磁编号并保存到FLASH
 @Input				Output_ID存放地址
 @Return				void
**********************************************************************************************************/
void GAT_GetOutputID(u16 *outputid)
{
	u8 i = 0;
	
