gdgly/stm32_a7108_rev4v2_gat920/Hardware/gat920/gatconfig.c
	for (i = 0; i < DetectionChannels; i++) {
		gatParamEquipment.output_ID[i] = outputid[i];
	}
	
	GAT_ParamSaveToFlash();
}

/**********************************************************************************************************
 @Function			u8 GAT_EventInitialized(void)
 @Description			GAT初始化事件
 @Input				void
 @Return				GAT_TRUE  : 正确
					GAT_FALSE : 错误
**********************************************************************************************************/
u8 GAT_EventInitialized(void)
{
	u8 Initialized = GAT_TRUE;
	u32 romSN = 0;
	USART_TypeDef* GAT920_USART = USART1;
	
	if (PlatformGat920Usart == Gat920_USART1) {											//根据SN选择Gat920连接串口1
		GAT920_USART = USART1;
	}
	else {																		//根据SN选择Gat920连接串口2
		GAT920_USART = USART2;
	}
	
	romSN = GAT_FlashRead(GAT_RO_FLashAddr);											//读取设备SN
	GAT_ParamReadToFlash();															//读取Flash中GAT配置信息
	if (romSN == 0xFFFFFFFF) {														//SN为空
		GAT_InitParamDetectorDefault(0x12345678);
		GAT_ParamSaveToFlash();
	}
	else if (gatParamEquipment.SN != romSN) {											//SN不为GAT配置信息中sn
		GAT_InitParamDetectorDefault(romSN);
		GAT_ParamSaveToFlash();
	}

	GAT_EnterCriticalSection();
	
	Initialized = GAT_PortSerialInit(GAT920_USART, GAT920_BAUDRATE, 8, GAT_PAR_NONE);			//串口硬件初始化默认波特率
	
	memset((u8 *)&GATReceiveBuf, 0x0, sizeof(GATReceiveBuf));								//清空接收数据缓存区
	memset((u8 *)&GATSendBuf, 0x0, sizeof(GATSendBuf));									//清空发送数据缓存区
	GATReceiveLength = 0;															//接收数据长度清0
	GATSendLength = 0;																//发送数据长度清0
	
	GAT_ExitCriticalSection();
	
	if (Initialized != GAT_FALSE) {
		GATEvent = GAT_EVENT_READY;													//进入READY事件
		GAT_USART_RXIT = 1;
		GAT_USART_TXIT = 0;
		GAT_PortSerialEnable(1, 0);													//开启接收中断
	}
	else {
		GATEvent = GAT_EVENT_INITIALIZED;												//进入INITIALIZED事件
		GAT_USART_RXIT = 0;
		GAT_USART_TXIT = 0;
		GAT_PortSerialEnable(0, 0);													//关闭串口中断
	}
	
	return Initialized;
}

/**********************************************************************************************************
 @Function			u8 GAT_EventReady(void)
 @Description			GAT准备中事件
 @Input				void
 @Return				GAT_TRUE  : 正确
					GAT_FALSE : 错误
**********************************************************************************************************/
u8 GAT_EventReady(void)
{
	u8 error = GAT_TRUE;
	
	if ((GAT_USART_RXIT != 1) && (GAT_USART_TXIT != 1)) {
		GAT_USART_RXIT = 1;
		GAT_USART_TXIT = 0;
		GAT_PortSerialEnable(1, 0);													//开启接收中断
	}
	
	/* 主线查询/设置事件 */
	if (GATReceiveLength & 0X8000) {													//接收到一帧串口数据
		GAT_USART_RXIT = 0;
		GAT_USART_TXIT = 0;
		GAT_PortSerialEnable(0, 0);													//关闭串口中断
		GATEvent = GAT_EVENT_FRAME_RECEIVED;											//进入FRAME_RECEIVED事件
		goto exit;
	}
	
	if (GATConnect != GAT_OFFLINE) {
		/* 支线脉冲数据主动上传 */
		if ((GAT_UploadQueueisEmpty() == 0) && (GATUPLOADAck != GAT_NotReceivedAck)) {				//脉冲数据上传队列有待处理数据且无需等待主动上传应答
			//delay_1ms(GAT920_UPLOAD_SEND_DELAY_MS);
			if (systime_time_meter1 != 1) {
				systime_time_meter1 = 1;
				systime_runtime_ms1 = 0;
			}
			if (systime_runtime_ms1 >= GAT920_UPLOAD_SEND_DELAY_MS) {
				systime_time_meter1 = 0;
				systime_runtime_ms1 = 0;
				GAT_USART_RXIT = 0;
				GAT_USART_TXIT = 0;
				GAT_PortSerialEnable(0, 0);													//关闭串口中断
				GATActiveUpLoadMode = GAT_ActiveUpLoadMode_PULSE;									//脉冲数据主动上传
				GATEvent = GAT_EVENT_ACTIVEUPLOAD;												//进入ACTIVEUPLOAD事件
			}
		}
		/* 支线统计数据主动上传 */
		else if ((GAT_StatisticalQueueisEmpty() == 0) && (GATUPLOADAck != GAT_NotReceivedAck)) {		//统计数据上传队列有待处理数据且无需等待主动上传应答
			//delay_1ms(GAT920_UPLOAD_SEND_DELAY_MS);
			if (systime_time_meter2 != 1) {
				systime_time_meter2 = 1;
				systime_runtime_ms2 = 0;
			}
			if (systime_runtime_ms2 >= GAT920_UPLOAD_SEND_DELAY_MS) {
				systime_time_meter2 = 0;
				systime_runtime_ms2 = 0;
				GAT_USART_RXIT = 0;
				GAT_USART_TXIT = 0;
				GAT_PortSerialEnable(0, 0);													//关闭串口中断
				GATActiveUpLoadMode = GAT_ActiveUpLoadMode_STATISTICS;								//统计数据主动上传
				GATEvent = GAT_EVENT_ACTIVEUPLOAD;												//进入ACTIVEUPLOAD事件
			}
		}
	}
	/* 空闲事件 */
	else {
		GATEvent = GAT_EVENT_READY;													//进入READY事件
	}
	
exit:
	return error;
}

/**********************************************************************************************************
 @Function			u8 GAT_EventFrameReceived(void)
 @Description			GAT接收数据前期处理事件
 @Input				void
 @Return				GAT_TRUE  : 正确
					GAT_FALSE : 错误
**********************************************************************************************************/
u8 GAT_EventFrameReceived(void)
{
	u8 error = GAT_TRUE;
	u16 frameLength = 0;															//接收数据长度
	u16 changeLength = 0;															//转换后数据长度
	
	frameLength = GATReceiveLength & (~(1<<15));											//获取接收数据长度
	if (frameLength == 0) {															//没有接受到数据而进入接收数据处理事件
		memset((u8 *)&GATReceiveBuf, 0x0, sizeof(GATReceiveBuf));							//清空接收数据缓存区
		GATReceiveLength = 0;														//接收数据长度清0
		GATEvent = GAT_EVENT_READY;													//进入READY事件
		GAT_USART_RXIT = 1;
		GAT_USART_TXIT = 0;
		GAT_PortSerialEnable(1, 0);													//开启接收中断
		return GAT_FALSE;
	}
	
	changeLength = GAT_ReceiveBufToDataFrame((u8 *)GATReceiveBuf, frameLength);				//提取GAT数据帧
	if (changeLength == 0) {															//无有效GAT数据帧
		memset((u8 *)&GATReceiveBuf, 0x0, sizeof(GATReceiveBuf));							//清空接收数据缓存区
		GATReceiveLength = 0;														//接收数据长度清0
		GATEvent = GAT_EVENT_READY;													//进入READY事件
		GAT_USART_RXIT = 1;
		GAT_USART_TXIT = 0;
		GAT_PortSerialEnable(1, 0);													//开启接收中断
		return GAT_FALSE;
	}
	else {																		//有效GAT数据帧
		GATReceiveLength = changeLength;												//帧长传递
		GATEvent = GAT_EVENT_EXECUTE;													//进入EXECUTE事件
	}
	
	return error;
}

/**********************************************************************************************************
 @Function			u8 GAT_EventExecute(void)
 @Description			GAT接收数据分析处理事件
 @Input				void
 @Return				GAT_TRUE  : 正确
					GAT_FALSE : 错误
**********************************************************************************************************/
u8 GAT_EventExecute(void)
{
	u8 error = GAT_TRUE;
	u16 sheetlength = 0;															//数据表长度
	
