gdgly/stm32_a7108_rev4v2_gat920/Hardware/gat920/gatconfig.c
	error = GAT_CheckCode((u8 *)GATReceiveBuf, GATReceiveLength);							//校验码检测
	if (error != GAT_TRUE) {															//校验码错误
		GAT_ErrorDataWrite(CHECKCODEERROR);											//出错应答写入缓存区
		GATEvent = GAT_EVENT_FRAME_SENT;												//进入SENT事件
		return GAT_TRUE;
	}
	
	sheetlength = GAT_DataFrameToDataSheet((u8 *)GATReceiveBuf, GATReceiveLength);				//将数据帧转换为数据表
	if (sheetlength != 0) {															//转换成功
		GATReceiveLength = sheetlength;												//传递数据表长度
		
		error = GAT_CheckLinkAddress((u8 *)GATReceiveBuf, LINKADDRESS);						//链路地址检测
		if (error != GAT_TRUE) {														//链路地址不为本机设备链路地址
			error = GAT_FALSE;
			memset((u8 *)&GATReceiveBuf, 0x0, sizeof(GATReceiveBuf));						//清空接收数据缓存区
			memset((u8 *)&GATSendBuf, 0x0, sizeof(GATSendBuf));							//清空发送数据缓存区
			GATReceiveLength = 0;													//接收数据长度清0
			GATSendLength = 0;														//发送数据长度清0
			GATEvent = GAT_EVENT_READY;												//进入READY事件
			GAT_USART_RXIT = 1;
			GAT_USART_TXIT = 0;
			GAT_PortSerialEnable(1, 0);												//开启接收中断
			return GAT_FALSE;
		}
		
		error = GAT_CheckVersion((u8 *)GATReceiveBuf);									//协议版本检测
		if (error != GAT_TRUE) {														//协议版本不兼容
			GAT_ErrorDataWrite(CHECKVERSIONERROR);										//出错应答写入缓存区
			GATEvent = GAT_EVENT_FRAME_SENT;											//进入SENT事件
			return GAT_TRUE;
		}
		
		error = GAT_CheckMessageType((u8 *)GATReceiveBuf);								//消息类型检测
		if (error != GAT_TRUE) {														//消息类型错误
			GAT_ErrorDataWrite(CHECKMESSAGETYPEERROR);									//出错应答写入缓存区
			GATEvent = GAT_EVENT_FRAME_SENT;											//进入SENT事件
			return GAT_TRUE;
		}
		
		error = GAT_CheckMessageContent((u8 *)GATReceiveBuf, GATReceiveLength);				//消息内容检测
		if (error != GAT_TRUE) {														//消息内容错误
			GAT_ErrorDataWrite(CHECKMESSAGECONTENTERROR);								//出错应答写入缓存区
			GATEvent = GAT_EVENT_FRAME_SENT;											//进入SENT事件
			return GAT_TRUE;
		}
		
		/* 数据帧转换成功并校验无误 */
		error = GAT_SelectExecuteCmd((u8 *)GATReceiveBuf, GATReceiveLength);					//判断处理不同数据表
		if (error == GAT_TRUE) {														//执行正确
			GATEvent = GAT_EVENT_FRAME_SENT;											//进入SENT事件
			return GAT_TRUE;
		}
		else if (error == GAT_DATAFALSE) {												//消息内容错误
			memset((u8 *)&GATReceiveBuf, 0x0, sizeof(GATReceiveBuf));						//清空接收数据缓存区
			memset((u8 *)&GATSendBuf, 0x0, sizeof(GATSendBuf));							//清空发送数据缓存区
			GATReceiveLength = 0;													//接收数据长度清0
			GATSendLength = 0;														//发送数据长度清0
			GAT_ErrorDataWrite(CHECKMESSAGECONTENTERROR);								//出错应答写入缓存区
			GATEvent = GAT_EVENT_FRAME_SENT;											//进入SENT事件
			return GAT_TRUE;
		}
		else if (error == GAT_RECEIVEEVENT) {											//接收到主动上传应答表
			memset((u8 *)&GATReceiveBuf, 0x0, sizeof(GATReceiveBuf));						//清空接收数据缓存区
			memset((u8 *)&GATSendBuf, 0x0, sizeof(GATSendBuf));							//清空发送数据缓存区
			GATReceiveLength = 0;													//接收数据长度清0
			GATSendLength = 0;														//发送数据长度清0
			GATEvent = GAT_EVENT_READY;												//进入READY事件
			GAT_USART_RXIT = 1;
			GAT_USART_TXIT = 0;
			GAT_PortSerialEnable(1, 0);												//开启接收中断
			return GAT_TRUE;
		}
		else {																	//执行错误
			error = GAT_FALSE;
			memset((u8 *)&GATReceiveBuf, 0x0, sizeof(GATReceiveBuf));						//清空接收数据缓存区
			memset((u8 *)&GATSendBuf, 0x0, sizeof(GATSendBuf));							//清空发送数据缓存区
			GATReceiveLength = 0;													//接收数据长度清0
			GATSendLength = 0;														//发送数据长度清0
			GATEvent = GAT_EVENT_READY;												//进入READY事件
			GAT_USART_RXIT = 1;
			GAT_USART_TXIT = 0;
			GAT_PortSerialEnable(1, 0);												//开启接收中断
			return GAT_FALSE;
		}
	}
	else {																		//转换失败
		error = GAT_FALSE;
		memset((u8 *)&GATReceiveBuf, 0x0, sizeof(GATReceiveBuf));							//清空接收数据缓存区
		GATReceiveLength = 0;														//接收数据长度清0
		GATEvent = GAT_EVENT_READY;													//进入READY事件
		GAT_USART_RXIT = 1;
		GAT_USART_TXIT = 0;
		GAT_PortSerialEnable(1, 0);													//开启接收中断
		return GAT_FALSE;
	}
}

/**********************************************************************************************************
 @Function			u8 GAT_EventFrameSent(void)
 @Description			GAT发送数据后期处理事件
 @Input				void
 @Return				GAT_TRUE  : 正确
					GAT_FALSE : 错误
**********************************************************************************************************/
u8 GAT_EventFrameSent(void)
{
	u8 error = GAT_TRUE;
	u16 framelength = 0;															//数据帧长度
	static u8 sending = 0;															//发送数据状态 1.发送中 0.无发送 
	
	if (sending == 0) {																//无数据发送
		if (GATSendLength != 0) {													//有数据需要发送
			framelength = GAT_DataSheetToDataFrame((u8 *)GATSendBuf, GATSendLength);			//将数据表转换为数据帧
			GATSendLength = framelength;												//传递数据帧长度
			sending = 1;															//标记发送数据中
			GATEvent = GAT_EVENT_FRAME_SENT;											//进入SENT事件
			GAT_USART_RXIT = 0;
			GAT_USART_TXIT = 1;
			GAT_PortSerialEnable(0, 1);												//开启发送中断
			return GAT_TRUE;
		}
		else {																	//无数据需要发送
			error = GAT_FALSE;
			memset((u8 *)&GATReceiveBuf, 0x0, sizeof(GATReceiveBuf));						//清空接收数据缓存区
			memset((u8 *)&GATSendBuf, 0x0, sizeof(GATSendBuf));							//清空发送数据缓存区
			GATReceiveLength = 0;													//接收数据长度清0
			GATSendLength = 0;														//发送数据长度清0
			GATEvent = GAT_EVENT_READY;												//进入READY事件
			GAT_USART_RXIT = 1;
			GAT_USART_TXIT = 0;
			GAT_PortSerialEnable(1, 0);												//开启接收中断
			return GAT_FALSE;
		}
	}
	else {																		//发送数据中
		if (GATSendLength & 0X8000) {													//发送完一帧数据
			GAT_USART_RXIT = 0;
			GAT_USART_TXIT = 0;
			GAT_PortSerialEnable(0, 0);												//关闭串口中断
			sending = 0;															//标记无数据发送中
			memset((u8 *)&GATReceiveBuf, 0x0, sizeof(GATReceiveBuf));						//清空接收数据缓存区
			memset((u8 *)&GATSendBuf, 0x0, sizeof(GATSendBuf));							//清空发送数据缓存区
			GATReceiveLength = 0;													//接收数据长度清0
			GATSendLength = 0;														//发送数据长度清0
			GATEvent = GAT_EVENT_READY;												//进入READY事件
			GAT_USART_RXIT = 1;
			GAT_USART_TXIT = 0;
			GAT_PortSerialEnable(1, 0);												//开启接收中断
			return GAT_TRUE;
		}
		else {																	//正在发送中
			GATEvent = GAT_EVENT_FRAME_SENT;											//进入SENT事件
		}
	}
	
	return error;
}

/**********************************************************************************************************
 @Function			u8 GAT_EventActiveUpload(void)
 @Description			GAT主动上传事件
 @Input				void
 @Return				GAT_TRUE  : 正确
					GAT_FALSE : 错误
**********************************************************************************************************/
u8 GAT_EventActiveUpload(void)
{
	u8 error = GAT_TRUE;
	
	/* 统计数据主动上传 */
	if (GATActiveUpLoadMode == GAT_ActiveUpLoadMode_STATISTICS) {
		error = GAT_ActiveStatisticalDataWrite();										//将统计数据写入脉冲数据主动上传表到发送缓存区
		if (error == GAT_TRUE) {														//执行正确
			GATEvent = GAT_EVENT_FRAME_SENT;											//进入SENT事件
			GATUPLOADAck = GAT_NotReceivedAck;											//等待接收应答表
			GATActiveUpLoadMode = GAT_ActiveUpLoadMode_NONE;
			return GAT_TRUE;
		}
		else {																	//执行错误
			error = GAT_FALSE;
			GATActiveUpLoadMode = GAT_ActiveUpLoadMode_NONE;
			GAT_StatisticalDequeueMove();
			memset((u8 *)&GATReceiveBuf, 0x0, sizeof(GATReceiveBuf));						//清空接收数据缓存区
			memset((u8 *)&GATSendBuf, 0x0, sizeof(GATSendBuf));							//清空发送数据缓存区
			GATReceiveLength = 0;													//接收数据长度清0
			GATSendLength = 0;														//发送数据长度清0
			GATEvent = GAT_EVENT_READY;												//进入READY事件
			GAT_USART_RXIT = 1;
			GAT_USART_TXIT = 0;
			GAT_PortSerialEnable(1, 0);												//开启接收中断
			return GAT_FALSE;
		}
	}
	/* 脉冲数据主动上传 */
	else if (GATActiveUpLoadMode == GAT_ActiveUpLoadMode_PULSE) {
		error = GAT_ActiveUpLoadDataWrite();											//将脉冲数据写入脉冲数据主动上传表到发送缓存区
		if (error == GAT_TRUE) {														//执行正确
			GATEvent = GAT_EVENT_FRAME_SENT;											//进入SENT事件
			GATUPLOADAck = GAT_NotReceivedAck;											//等待接收应答表
			GATActiveUpLoadMode = GAT_ActiveUpLoadMode_NONE;
			return GAT_TRUE;
		}
		else {																	//执行错误
			error = GAT_FALSE;
			GATActiveUpLoadMode = GAT_ActiveUpLoadMode_NONE;
			GAT_UploadDequeueMove();
			memset((u8 *)&GATReceiveBuf, 0x0, sizeof(GATReceiveBuf));						//清空接收数据缓存区
			memset((u8 *)&GATSendBuf, 0x0, sizeof(GATSendBuf));							//清空发送数据缓存区
			GATReceiveLength = 0;													//接收数据长度清0
			GATSendLength = 0;														//发送数据长度清0
			GATEvent = GAT_EVENT_READY;												//进入READY事件
			GAT_USART_RXIT = 1;
			GAT_USART_TXIT = 0;
			GAT_PortSerialEnable(1, 0);												//开启接收中断
			return GAT_FALSE;
		}
	}
	/* 检测器故障主动上传 */
	else if (GATActiveUpLoadMode == GAT_ActiveUpLoadMode_FAULT) {
		
