gdgly/stm32_a7108_rev4v2_gat920/Hardware/gat920/gatconfig.c
	}
	else {
		return GAT_FALSE;
	}
	
	return error;
}

/**********************************************************************************************************
 @Function			void GAT_PollExecution(void)
 @Description			处理GAT协议各个事件
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
							    <-----  |             <--error--        |
执行错误:			SENT ERR MESSAGE   <-----  |  <--error--  |                |
									  |              |                |
主线状态:				INITIALIZED  ---->  READY  ---->  RECEIVED  ---->  EXECUTE  ---->  SENT
									  |                                              |
执行成功:								  |  <----------------successd-----------------  |
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
执行错误:			                           |    <--error--   |
									  |                 |
支线状态:				INITIALIZED  ---->  READY  ---->  ACTIVEUPLOAD  ---->  SENT
									  |                                  |
执行成功:								  |  <----------successd-----------  |
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
 @Input				void
 @Return				void
**********************************************************************************************************/
void GAT_PollExecution(void)
{
	switch (GATEvent)															//GAT协议处理状态转换机
	{
	case GAT_EVENT_READY:														//READY
		if (GAT_EventReady() != GAT_TRUE) {
			GATEvent = GAT_EVENT_READY;
		}
		break;
	
	case GAT_EVENT_FRAME_RECEIVED:												//RECEIVED
		if (GAT_EventFrameReceived() != GAT_TRUE) {
			GATEvent = GAT_EVENT_READY;
		}
		break;
	
	case GAT_EVENT_FRAME_SENT:													//SENT
		if (GAT_EventFrameSent() != GAT_TRUE) {
			GATEvent = GAT_EVENT_READY;
		}
		break;
	
	case GAT_EVENT_EXECUTE:														//EXECUTE
		if (GAT_EventExecute() != GAT_TRUE) {
			GATEvent = GAT_EVENT_READY;
		}
		break;
	
	case GAT_EVENT_INITIALIZED:													//INITIALIZED
		if (GAT_EventInitialized() != GAT_TRUE) {
			GATEvent = GAT_EVENT_INITIALIZED;
		}
		break;
		
	case GAT_EVENT_ACTIVEUPLOAD:													//ACTIVEUPLOAD
		if (GAT_EventActiveUpload() != GAT_TRUE) {
			GATEvent = GAT_EVENT_READY;
		}
		break;
	}
}

/* gat920外部接口例化各函数 */
struct _m_gat920_dev gat920_dev = 
{
	GAT_PollExecution,															//处理GAT协议各个事件
	GAT_EventInitialized,														//GAT初始化事件
	GAT_EventReady,															//GAT准备中事件
	GAT_EventFrameReceived,														//GAT接收数据前期处理事件
	GAT_EventExecute,															//GAT接收数据分析处理事件
	GAT_EventFrameSent,															//GAT发送数据后期处理事件
	GAT_EventActiveUpload,														//GAT主动上传事件
	
	GAT_ParamSaveToFlash,														//保存GAT检测器参数到Flash
	GAT_ParamReadToFlash,														//读取GAT检测器参数到Ram
	GAT_InitParamDetectorDefault,													//初始化GAT检测器参数
	GAT_GetOutputID,															//读取output_ID输出端口的参数到GAT脉冲上传通道号对应地磁编号
	
	GAT_ReceiveBufToDataFrame,													//从接收到的数据中提取数据帧
	GAT_DataSheetToDataFrame,													//将数据表转换为数据帧
	GAT_DataFrameToDataSheet,													//将数据帧转换为数据表
	GAT_DataSheetToMessage,														//从数据表中提取消息内容
	
	GAT_CheckCode,																//检测校验码是否正确-----------错误类型 1
	GAT_CheckVersion,															//检测协议版本是否兼容---------错误类型 2
	GAT_CheckMessageType,														//检测消息类型是否正确---------错误类型 3
	GAT_CheckMessageContent,														//检测消息内容数据是否正确-----错误类型 4
	
	GAT_LinkAddress_Send,														//检测器链路地址发送
	GAT_LinkAddress_Receive,														//检测器接收链路地址读取
	
	GAT_GatOperationType,														//获取操作类型值
	GAT_GatObjectId,															//获取对象标识值
	
	GAT_UARTx_IRQ,																//GAT协议串口中断处理函数
	GAT_EnterCriticalSection,													//进入关键操作,关闭中断,等待中断结束返回
	GAT_ExitCriticalSection,														//退出关键操作,开启中断
	
	GAT_InitUploadQueue,														//初始化Upload队列
	GAT_UploadEnqueue,															//脉冲数据写入队列
	GAT_UploadDequeue,															//脉冲数据读出队列
	
	GAT_UploadOvertime,															//主动上传接收应答超时处理
	
	GAT_ImplementEnqueue,														//到达统计时间将统计数据存入队列
};

extern unsigned short output_ID[OUTPUT_MAX];

/**********************************************************************************************************
 @Function			void GAT_CarInUploadEnqueue(unsigned char dici_index)
 @Description			GAT_CarInUploadEnqueue	: 获取车辆驶入信息
 @Input				dici_index			: 0 ~ 31车辆号
 @Return				void
**********************************************************************************************************/
void GAT_CarInUploadEnqueue(unsigned char dici_index)
{
#ifdef GAT920_ENABLE
	u8 xx = 0;
	u8 yy = 0;
	
	if (PlatformGat920 == Gat920_ENABLE) {
		if (GATConnect == GAT_ONLINE) {
			xx = dici_index / 8;
			yy = dici_index % 8;
			if ((gatParamPulse.pulseUploadBit[xx] & (0x01 << yy)) != 0) {
				gat920_dev.UploadEnqueue(output_ID[dici_index], GAT_INDETECTIONAREA);
			}
		}
	}
#endif
}

/**********************************************************************************************************
 @Function			void GAT_CarOutUploadEnqueue(unsigned char dici_index)
 @Description			GAT_CarOutUploadEnqueue	: 获取车辆驶离信息
 @Input				dici_index			: 0 ~ 31车辆号
 @Return				void
**********************************************************************************************************/
void GAT_CarOutUploadEnqueue(unsigned char dici_index)
{
#ifdef GAT920_ENABLE
	u8 xx = 0;
	u8 yy = 0;
	
	if (PlatformGat920 == Gat920_ENABLE) {
		if (GATConnect == GAT_ONLINE) {
			xx = dici_index / 8;
			yy = dici_index % 8;
			if ((gatParamPulse.pulseUploadBit[xx] & (0x01 << yy)) != 0) {
				gat920_dev.UploadEnqueue(output_ID[dici_index], GAT_OUTDETECTIONAREA);
			}
		}
	}
#endif
}

/********************************************** END OF FLEE **********************************************/
